package extratasks.addhomework6.array_for_loop.task10;

import java.util.Arrays;

public class Task10 {

    /*Напишите программу, в которой:
            - создайте массив целых чисел длиной 3,
            - заполните каждую ячейку массива любым целым числом,
            - выведите значение каждой ячейки на консоль.*/


    public static void main(String[] args) {

        int [] myAraay = new int[3];
        myAraay [0] = 10;
        myAraay [1] = 20;
        myAraay [2] = 30;
        System.out.println(Arrays.toString(myAraay));
    }



}
